[
  {
    "name": "Torin Oakenshield",
    "description": "Thorin II was born in TA 2746 to Dwarf prince Thráin II in the city of the Lonely Mountain. Early in his youth, he and the other Dwarves of the Lonely Mountain were forced to flee by the dragon Smaug in TA 2770. While in exile, he quickly grew to become a capable warrior. This was demonstrated when he participated in the Battle of Azanulbizar in TA 2799. He fought with one of the Dwarven armies beneath the East-gate of Moria. At some point in the fighting, his shield broke, and using an oaken tree branch found on the ground as a shield, he gained the epithet 'Oakenshield', which would remain with him even in death.",
    "image_source": "https://64.media.tumblr.com/4a29b4e784b59dabac6f98f8a79db7f1/tumblr_oc90p2NTVb1sfw50yo1_1280.png"
  },

  {
    "name": "Fíli and Kíli",
    "description": "Fíli and Kíli were the two most active dwarves of Thorin's company, and apart from Balin, and possibly Bombur, they appeared more frequently as 'individual' characters in Tolkien's novel than the rest of Thorin's companions, who were most often named only in 'group' references to the entire company.",
    "image_source": "https://64.media.tumblr.com/ee07db2fa7a4eacf829f909db6fe580d/tumblr_myp4wrLcfS1qjl12lo1_1280.jpg"
  },

  {
    "name": "Óin",
    "description": "Óin was the older brother of Glóin, cousin of Dwalin and Balin, and uncle of Gimli. Óin's uncle was Fundin, the father of Balin and Dwalin. He usually wore a brown-hooded cloak when travelling. Óin fought in the Battle of Azanulbizar along with Thorin Oakenshield, and in TA 2941 joined with Thorin and Company on the quest to reclaim the Lonely Mountain wearing a brown hood.",
    "image_source": "https://i.pinimg.com/originals/9e/63/df/9e63df48ce2306ee0e0a164b29303257.jpg"
  },

  {
    "name": "Gloin",
    "description": "Glóin was born in TA 2783, after the dragon Smaug desolated Erebor. He was the younger child of Gróin and younger brother of Óin.",
    "image_source": "https://i.pinimg.com/736x/78/f9/db/78f9db4d53d3c7ac4b43a707cf02075a--hobbit-art-guardians-of-gahoole.jpg"
  },

  {
    "name": "Balin",
    "description": "Balin was likely born in the Lonely Mountain before the coming of the dragon Smaug. He had a younger brother named Dwalin, and was amongst those driven from their homes when Smaug attacked the Lonely Mountain. Afterwards, he may have lived in Dunland as a refugee, before fighting in the War of the Dwarves and Orcs which culminated in the Battle of Azanulbizar. Many years later, in approximately TA 2841, he accompanied Thráin II, the father of Thorin, when he attempted to go back to the Lonely Mountain himself, but Thráin was captured and lost",
    "image_source": "https://2.bp.blogspot.com/--cJDAsJiJgs/UIrxagJT2MI/AAAAAAAADFk/DDBjOZfliSU/s1600/Balin.jpg"
  },
  
  {
    "name": "Dwalin",
    "description": "Born in TA 2772, two years after the dragon Smaug had desolated Erebor, Dwalin was the son of Fundin and younger brother of Balin. After fighting in the Battle of Azanulbizar at the age of 27, Dwalin accompanied Thráin II and Thorin Oakenshield to settle peacefully in the northern Ered Luin. Later in TA 2841, Dwalin, along with his brother Balin, and a few others accompanied Thráin when he left the Ered Luin on a Quest to reclaim Erebor. The small party was dogged by the emissaries of Sauron. In TA 2845, Thráin was captured one night when he and his companions sheltered under the eaves of Mirkwood from a black rain. After a fruitless search for their king, the Dwarves gave up and returned to Thorin to inform him the news.",
    "image_source": "https://i.pinimg.com/originals/5e/c2/1e/5ec21e95a019c3d7db5c141dd216b29c.jpg"
  },

  {
    "name": "Ori",
    "description": "Ori lived in Thorin's Halls in the northern Blue Mountains for many years. In the year TA 2941, Ori became a member of Thorin's Company and travelled with Thorin, Gandalf, Bilbo Baggins, and the other Dwarves on the quest for the Lonely Mountain, culminating in the death of Smaug. Finally, he and the other Dwarves of Thorin's Company fought in the Battle of Five Armies, which he survived.",
    "image_source": "https://i.pinimg.com/736x/fa/38/c0/fa38c055d58aef51d564bc75686b3f3e.jpg"
  },

  {
    "name": "Dori",
    "description": "Before the Quest of Erebor, Dori lived in Thorin's Halls in the northern Blue Mountains with Nori and Ori. In TA 2941, the three became part of Thorin and Company, befriending Bilbo Baggins and traveling with him in search of Smaug's treasure at the Lonely Mountain.",
    "image_source": "https://64.media.tumblr.com/a35d24e91d53b8849b76058f2fe39fb9/8f2166430a9a8c14-37/s1280x1920/5ec22dbccac8ae16ddf84f9bfe4069028b874c40.png"
  },

  {
    "name": "Nori",
    "description": "Nori, as was his brother Dori, was a capable flutist, and both seem to have carried their flutes with them. Both shared Bilbo's liking for regular meals. Before the Quest for the Lonely Mountain, Nori lived in Thorin's Halls in the northern Blue Mountains with his two brothers.",
    "image_source": "https://assets.vg247.com/current/2012/10/nori.jpg"
  },

  {
    "name": "Bifur",
    "description": "Whilst he was a descendant of the Dwarves of Khazad-dûm, Bifur was not related to the royal House of Durin. Most of his familial relations are unclear, and what is known of his parentage is very little. He and his family were driven out of their home in the Lonely Mountain by the dragon Smaug, and were forced to live in exile, where the Dwarf warrior worked as a toy maker. Following Thorin II Oakenshield to a new life at his halls in the Blue Mountains, he continued his life as a toy maker.",
    "image_source": "https://i.pinimg.com/originals/97/35/a9/9735a96885e6b627f03e859e587d788e.jpg"
  },

  {
    "name": "Bofur",
    "description": "Bofur was not related to the royal House of Durin but was descended from the Dwarves of Khazad-dûm. While answering Thorin Oakenshield's quest to Erebor, Bofur went to the meeting at Bag End with his brother Bombur and cousin Bifur. He accompanied Thorin, Gandalf, Bilbo Baggins, and rest of Thorin's Company across Wilderland to the Lonely Mountain in order to reclaim the Dwarves' treasure from the dragon Smaug.",
    "image_source": "https://i.pinimg.com/736x/c9/4a/c9/c94ac90e7f80b0dc95f22d68c019fadf--lo-hobbit-hobbit-art.jpg"
  },

  {
    "name": "Bombur",
    "description": "Bombur's parentage is unknown. He was the brother of Bofur and cousin of Bifur. Bombur was not of Durin's line, although he was descended from the Dwarves of Khazad-dûm. His birth date is unknown, though it fell somewhere between TA 2763 and TA 2859; the brothers Fíli and Kíli were the youngest of the thirteen 'by some fifty years', and, after Thorin was captured, Balin was 'the eldest left.' Fíli was born in TA 2859, and Balin was born in TA 2763. Bombur was thus roughly 150 years old during the quest. Prior to the journey, Bombur likely resided in the Blue Mountains alongside Thorin, after the loss of Thráin II.",
    "image_source": "https://i.pinimg.com/originals/b4/f3/e0/b4f3e024d59b06c4d58544055e9f46e9.jpg"
  },

  {
    "name": "Gandalf",
    "description": "Gandalf the Grey, later known as Gandalf the White, and originally named Olórin, was an Istar (Wizard), dispatched to Middle-earth in the Third Age to combat the threat of Sauron. He joined Thorin II Oakenshield and his company to reclaim the Lonely Mountain from Smaug, helped form the Fellowship of the Ring to destroy the One Ring, and led the Free Peoples in the final campaign of the War of the Ring.",
    "image_source": "https://wallpapercave.com/wp/g56F4Ld.jpg"
  }
]